"""
Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
Напишите решения через list и через dict.
"""
# вариант Б (dict)
season_dict = {1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето', 9: 'осень',
               10: 'осень', 11: 'осень', 12: 'зима'}
while True:  # Ввод номера с проверкой адекватности
    month = input('Введите номер месяца (целое число от 1 до 12) - ')
    if month.isdigit():
        month = int(month)
    else:
        continue
    if month > 0 and month <= 12:
        break
print(f'{month}-й месяц это {season_dict.get(month)}')
